package ru.hook.asm;

import java.lang.annotation.ElementType;
import java.lang.annotation.Target;

/**
 * Р§С‚РѕР±С‹ СЃРґРµР»Р°С‚СЊ РјРµС‚РѕРґ С…СѓРєРѕРј, РЅСѓР¶РЅРѕ РїРѕРІРµСЃРёС‚СЊ РЅР°Рґ РЅРёРј СЌС‚Сѓ Р°РЅРЅРѕС‚Р°С†РёСЋ Рё Р·Р°СЂРµРіРёСЃС‚СЂРёСЂРѕРІР°С‚СЊ РєР»Р°СЃСЃ СЃ С…СѓРєРѕРј.
 * <p/>
 * Р¦РµР»РµРІРѕР№ РєР»Р°СЃСЃ РѕРїСЂРµРґРµР»СЏРµС‚СЃСЏ РїРµСЂРІС‹Рј РїР°СЂР°РјРµС‚СЂРѕРј С…СѓРє-РјРµС‚РѕРґР°. Р•СЃР»Рё С†РµР»РµРІРѕР№ РјРµС‚РѕРґ static, С‚Рѕ С‚СѓРґР° РїСЂРёР»РµС‚Р°РµС‚ null,
 * РёРЅР°С‡Рµ - this.
 * <p/>
 * РќР°Р·РІР°РЅРёРµ С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР° РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ С‚Р°РєРѕРµ Р¶Рµ, РєР°Рє РЅР°Р·РІР°РЅРёРµ С…СѓРє-РјРµС‚РѕРґР°, РЅРѕ РµРіРѕ РјРѕР¶РЅРѕ РїРµСЂРµРѕРїСЂРµРґРµР»РёС‚СЊ С‡РµСЂРµР·
 * targetMethod.
 * <p/>
 * РЎРїРёСЃРѕРє РїР°СЂР°РјРµС‚СЂРѕРІ С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР° РѕРїСЂРµРґРµР»СЏРµС‚СЃСЏ СЃРїРёСЃРєРѕРј РїР°СЂР°РјРµС‚СЂРѕРІ С…СѓРє-РјРµС‚РѕРґР°. РќСѓР¶РЅРѕ РґРѕР±Р°РІРёС‚СЊ РІСЃРµ С‚Рµ Р¶Рµ РїР°СЂР°РјРµС‚СЂС‹
 * РІ С‚РѕРј Р¶Рµ РїРѕСЂСЏРґРєРµ.
 * <p/>
 * Р’РѕР·РІСЂР°С‰Р°РµРјС‹Р№ С‚РёРї С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР° РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ РЅРµ СѓРєР°Р·С‹РІР°РµС‚СЃСЏ РІРѕРѕР±С‰Рµ. РџСЂРµРґРїРѕР»Р°РіР°РµС‚СЃСЏ, С‡С‚Рѕ РјРµС‚РѕРґРѕРІ СЃ РѕРґРёРЅР°РєРѕРІС‹Рј
 * РЅР°Р·РІР°РЅРёРµРј Рё СЃРїРёСЃРєРѕРј РїР°СЂР°РјРµС‚СЂРѕРІ РЅРµС‚. Р•СЃР»Рё РІСЃС‘ Р¶Рµ РЅСѓР¶РЅРѕ СѓРєР°Р·Р°С‚СЊ, С‚Рѕ СЌС‚Рѕ РјРѕР¶РЅРѕ СЃРґРµР»Р°С‚СЊ С‡РµСЂРµР· returnType.
 */
@Target(ElementType.METHOD)
public @interface Hook {

    /**
     * Р—Р°РґР°РµС‚ СѓСЃР»РѕРІРёРµ, РїРѕ РєРѕС‚РѕСЂРѕРјСѓ РїРѕСЃР»Рµ РІС‹Р·РѕРІР° С…СѓРєР° Р±СѓРґРµС‚ РІС‹Р·РІР°РЅ return.
     * Р•СЃР»Рё С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ РЅРµ void, С‚Рѕ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ Р±СѓРґРµС‚ РІРѕР·РІСЂР°С‰РµРЅРѕ С‚Рѕ, С‡С‚Рѕ РІРµСЂРЅСѓР» С…СѓРє-РјРµС‚РѕРґ.
     * Р­С‚Рѕ РјРѕР¶РЅРѕ РїРµСЂРµРѕРїСЂРµРґРёР»РёС‚СЊ РЅРµСЃРєРѕР»СЊРєРёРјРё СЌР»РµРјРµРЅС‚Р°РјРё Р°РЅРЅРѕС‚Р°С†РёРё:
     * returnAnotherMethod, returnNull Рё %type%ReturnConstant.
     */
    ReturnCondition returnCondition() default ReturnCondition.NEVER;

    /**
     * Р—Р°РґР°РµС‚ РїСЂРёРѕСЂРёС‚РµС‚ С…СѓРєР°.
     * РҐСѓРєРё СЃ Р±РѕР»СЊС€РёРј РїСЂРёРѕСЂРёС‚РµС‚РѕРј РІС‹Р·Р°РІР°СЋС‚СЃСЏ СЂР°РЅСЊС€Рµ.
     */
    HookPriority priority() default HookPriority.NORMAL;

    /**
     * Р—Р°РґР°РµС‚ РЅР°Р·РІР°РЅРёРµ С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР°.
     * РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РЅР°Р·РІР°РЅРёРµ С…СѓРє-РјРµС‚РѕРґР°.
     * Р­С‚Р° РѕРїС†РёСЏ РїРѕР»РµР·РЅР°, РєРѕРіРґР° РЅСѓР¶РЅРѕ РІСЃС‚Р°РІРёС‚СЊ С…СѓРє РІ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂ РёР»Рё РёРЅРёС†РёР°Р»РёР·Р°С†РёСЋ РєР»Р°СЃСЃР°.
     * Р”Р»СЏ РєРѕРЅСЃС‚СЂСѓРєС‚РѕСЂР° targetMethod РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ "<init>", РґР»СЏ РёРЅРёС†РёР°Р»РёР·Р°С†РёРё РєР»Р°СЃСЃР° - "<clinit>"
     */
    String targetMethod() default "";

    /**
     * Р—Р°РґР°РµС‚ С‚РёРї, РІРѕР·РІСЂР°С‰Р°РµРјС‹Р№ С†РµР»РµРІС‹Рј РјРµС‚РѕРґРѕРј.
     * РЎ С‚РѕС‡РєРё Р·СЂРµРЅРёСЏ JVM РјРѕРіСѓС‚ Р±С‹С‚СЊ РјРµС‚РѕРґС‹, РєРѕС‚РѕСЂС‹Рµ РѕС‚Р»РёС‡Р°СЋС‚СЃСЏ С‚РѕР»СЊРєРѕ РІРѕР·СЂР°С‰Р°РµРјС‹Рј С‚РёРїРѕРј.
     * РќР° РїСЂР°РєС‚РёРєРµ РєРѕРјРїРёР»СЏС‚РѕСЂС‹ С‚Р°РєРёС… РјРµС‚РѕРґРѕРІ РЅРµ РіРµРЅРµСЂРёСЂСѓСЋС‚, РЅРѕ РІ РЅРµРєРѕС‚РѕСЂС‹С… СЃР»СѓС‡Р°СЏС… РѕРЅРё
     * РјРѕРіСѓС‚ РІСЃС‚СЂРµС‚РёС‚СЊСЃСЏ (РЅР°РїСЂРёРјРµСЂ, СЌС‚Рѕ РјРѕР¶РЅРѕ СЃРґРµР»Р°С‚СЊ РїСЂРё РѕР±С„СѓСЃРєР°С†РёРё С‡РµСЂРµР· ProGuard)
     * Р•СЃР»Рё РІРѕР·РІСЂР°С‰Р°РµРјС‹Р№ С‚РёРї РЅРµ СѓРєР°Р·Р°РЅ, С‚Рѕ С…СѓРє РїСЂРёРјРµРЅСЏРµС‚СЃСЏ Рє РїРµСЂРІРѕРјСѓ РјРµС‚РѕРґСѓ, РїРѕРґС…РѕРґСЏС‰РµРјСѓ
     * РїРѕ РЅР°Р·РІР°РЅРёСЋ Рё СЃРїРёСЃРєСѓ РїР°СЂР°РјРµС‚СЂРѕРІ.
     * <p>
     * РћСЃРЅРѕРІРЅРѕР№ РїСЂРµРґРїРѕР»Р°РіР°РµРјС‹Р№ СЃРїРѕСЃРѕР± РёСЃРїРѕР»СЊР·РѕРІР°РЅРёСЏ СЌС‚РѕРіРѕ РїР°СЂР°РјРµС‚СЂР° - РІРјРµСЃС‚Рµ СЃ createMethod = true.
     * Р’ СЌС‚РѕРј СЃР»СѓС‡Р°Рµ СЃРѕР·РґР°РЅРЅС‹Р№ РјРµС‚РѕРґ Р±СѓРґРµС‚ РїРѕ СѓРјРѕР»С‡Р°РЅРёСЋ РёРјРµС‚СЊ С‚РѕС‚ Р¶Рµ РІРѕР·РІСЂР°С‰Р°РµРјС‹Р№ С‚РёРї, С‡С‚Рѕ Рё С…СѓРє-РјРµС‚РѕРґ,
     * Р° СЃ РїРѕРјРѕС‰СЊСЋ СЌС‚РѕРіРѕ РїР°СЂР°РјРµС‚СЂР° СЌС‚Рѕ РјРѕР¶РЅРѕ РёР·РјРµРЅРёС‚СЊ.
     * <p>
     * РЈРєР°Р·С‹РІР°С‚СЊ РЅСѓР¶РЅРѕ РїРѕР»РЅРѕРµ РЅР°Р·РІР°РЅРёРµ РєР»Р°СЃСЃР°: java.lang.String, void, int Рё С‚.Рґ.
     */
    String returnType() default "";

    /**
     * РџРѕР·РІРѕР»СЏРµС‚ РЅРµ С‚РѕР»СЊРєРѕ РІСЃС‚Р°РІР»СЏС‚СЊ С…СѓРєРё РІ СЃСѓС‰РµСЃС‚РІСѓСЋС‰РёРµ РјРµС‚РѕРґС‹, РЅРѕ Рё РґРѕР±Р°РІР»СЏС‚СЊ РЅРѕРІС‹Рµ. Р­С‚Рѕ РјРѕР¶РµС‚ РїРѕРЅР°РґРѕР±РёС‚СЊСЃСЏ,
     * РєРѕРіРґР° РЅСѓР¶РЅРѕ РїРµСЂРµРѕРїСЂРµРґРµР»РёС‚СЊ РјРµС‚РѕРґ СЃСѓРїРµСЂРєР»Р°СЃСЃР°. Р•СЃР»Рё СЃСѓРїРµСЂ-РјРµС‚РѕРґ РЅР°Р№РґРµРЅ, С‚Рѕ С‚РµР»Рѕ РіРµРЅРµСЂРёСЂСѓРµРјРѕРіРѕ РјРµС‚РѕРґР°
     * РїСЂРµРґСЃС‚Р°РІР»СЏРµС‚ СЃРѕР±РѕР№ РІС‹Р·РѕРІ СЃСѓРїРµСЂ-РјРµС‚РѕРґР°. Р�РЅР°С‡Рµ СЌС‚Рѕ РїСЂРѕСЃС‚Рѕ РїСѓСЃС‚РѕР№ РјРµС‚РѕРґ РёР»Рё return false/0/null РІ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё
     * РѕС‚ РІРѕР·РІСЂР°С‰Р°РµРјРѕРіРѕ С‚РёРїР°.
     */
    boolean createMethod() default false;


    /**
     * РџРѕР·РІРѕР»СЏРµС‚ РѕР±СЉСЏРІРёС‚СЊ С…СѓРє "РѕР±СЏР·Р°С‚РµР»СЊРЅС‹Рј" РґР»СЏ Р·Р°РїСѓСЃРєР° РёРіСЂС‹. Р’ СЃР»СѓС‡Р°Рµ РЅРµСѓРґР°С‡Рё РІРѕ РІСЂРµРјСЏ РІСЃС‚Р°РІРєРё С‚Р°РєРѕРіРѕ С…СѓРєР°
     * Р±СѓРґРµС‚ РЅРµ РїСЂРѕСЃС‚Рѕ РІС‹РІРµРґРµРЅРѕ СЃРѕРѕР±С‰РµРЅРёРµ РІ Р»РѕРі, Р° РєСЂР°С€РЅРµС‚СЃСЏ РёРіСЂР°.
     */
    boolean isMandatory() default false;

    /**
     * РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ С…СѓРє РІСЃС‚Р°РІР»СЏРµС‚СЃСЏ РІ РЅР°С‡Р°Р»Рѕ С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР°.
     * Р•СЃР»Рё СѓРєР°Р·Р°С‚СЊ Р·РґРµСЃСЊ true, С‚Рѕ РѕРЅ Р±СѓРґРµС‚ РІСЃС‚Р°РІР»РµРЅ РІ РєРѕРЅС†Рµ Рё РїРµСЂРµРґ РєР°Р¶РґС‹Рј РІС‹Р·РѕРІРѕРј return.
     */
    boolean injectOnExit() default false;

    /**
     * РџРѕ СѓРјРѕР»С‡Р°РЅРёСЋ С…СѓРє РІСЃС‚Р°РІР»СЏРµС‚СЃСЏ РІ РЅР°С‡Р°Р»Рѕ С†РµР»РµРІРѕРіРѕ РјРµС‚РѕРґР°.
     * Р•СЃР»Рё СѓРєР°Р·Р°С‚СЊ Р·РґРµСЃСЊ true, С‚Рѕ РѕРЅ Р±СѓРґРµС‚ РІСЃС‚Р°РІР»РµРЅ РІ РЅР°С‡Р°Р»Рµ СѓРєР°Р·Р°РЅРЅРѕР№ СЃС‚СЂРѕРєРё.
     * Р�СЃРїРѕР»СЊР·РѕРІР°С‚СЊ РЅРµ СЂРµРєРѕРјРµРЅРґСѓРµС‚СЃСЏ, РїРѕС‚РѕРјСѓ С‡С‚Рѕ:
     * 1) Р’СЃС‚Р°РІРёС‚СЊ РјРѕР¶РЅРѕ С‚РѕР»СЊРєРѕ РЅР° СЃС‚СЂРѕРєСѓ СЃ РёРЅСЃС‚СЂСѓРєС†РёРµР№
     * 2) РњРѕР¶РµС‚ Р’РќР•Р—РђРџРќРћ СЃР»РѕРјР°С‚СЊСЃСЏ (РЅР°РїСЂРёРјРµСЂ, РѕС‚ С‚РѕРіРѕ, С‡С‚Рѕ РєР°РєРѕР№-РЅРёР±СѓРґСЊ РѕРїС‚РёС„Р°Р№РЅ РїРѕРґРјРµРЅРёС‚ РєР»Р°СЃСЃ С†РµР»РёРєРѕРј)
     */
    @Deprecated int injectOnLine() default -1;

    /**
     * Р•СЃР»Рё СѓРєР°Р·Р°РЅРѕ СЌС‚Рѕ РЅР°Р·РІР°РЅРёРµ, С‚Рѕ РїСЂРё РІС‹Р·РѕРІРµ return РІ С†РµР»РµРІРѕРј РјРµС‚РѕРґРµ Р±СѓРґРµС‚ СЃРЅР°С‡Р°Р»Р° РІС‹Р·РІР°РЅ СЌС‚РѕС‚ РјРµС‚РѕРґ.
     * РћРЅ РґРѕР»Р¶РµРЅ РЅР°С…РѕРґРёС‚СЊСЃСЏ РІ С‚РѕРј Р¶Рµ РєР»Р°СЃСЃРµ Рё РёРјРµС‚СЊ С‚РѕС‚ Р¶Рµ СЃРїРёСЃРѕРє РїР°СЂР°РјРµС‚СЂРѕРІ, С‡С‚Рѕ Рё С…СѓРє-РјРµС‚РѕРґ.
     * Р’ РёС‚РѕРіРµ Р±СѓРґРµС‚ РІРѕР·РІСЂР°С‰РµРЅРѕ Р·РЅР°С‡РµРЅРёРµ, РєРѕС‚РѕСЂРѕРµ РІРµСЂРЅС‘С‚ СЌС‚РѕС‚ РјРµС‚РѕРґ.
     */
    String returnAnotherMethod() default "";

    /**
     * Р•СЃР»Рё true, С‚Рѕ РїСЂРё РІС‹Р·РѕРІРµ return РІ С†РµР»РµРІРѕРј РјРµС‚РѕРґРµ Р±СѓРґРµС‚ РІРѕР·РІСЂР°С‰РµРЅРѕ null
     */
    boolean returnNull() default false;

    /**
     * Р•СЃР»Рё РѕРїСЂРµРґРµР»РµРЅР° РѕРґРЅР° РёР· СЌС‚РёС… РєРѕРЅСЃС‚Р°РЅС‚, С‚Рѕ РѕРЅР° Р±СѓРґРµС‚ РІРѕР·РІСЂР°С‰РµРЅР° РїСЂРё РІС‹Р·РѕРІРµ return РІ С†РµР»РµРІРѕРј РјРµС‚РѕРґРµ
     */

    boolean booleanReturnConstant() default false;

    byte byteReturnConstant() default 0;

    short shortReturnConstant() default 0;

    int intReturnConstant() default 0;

    long longReturnConstant() default 0L;

    float floatReturnConstant() default 0.0F;

    double doubleReturnConstant() default 0.0D;

    char charReturnConstant() default 0;

    String stringReturnConstant() default "";

    @Target(ElementType.PARAMETER)
    @interface LocalVariable {
        int value();
    }

    /**
     * РџРµСЂРµС…РІР°С‚С‹РІР°РµС‚ Р·РЅР°С‡РµРЅРёРµ, РєРѕС‚РѕСЂРѕРµ РёР·РЅР°С‡Р°Р»СЊРЅРѕ С€Р»Рѕ РІ return, Рё РїРµСЂРµРґР°РµС‚ РµРіРѕ С…СѓРє-РјРµС‚РѕРґСѓ.
     * Р“РѕРІРѕСЂСЏ Р±РѕР»РµРµ С„РѕСЂРјР°Р»СЊРЅРѕ, РїРµСЂРµРґР°РµС‚ РїРѕСЃР»РµРґРЅРµРµ Р·РЅР°С‡РµРЅРёРµ РІ СЃС‚Р°РєРµ.
     * РњРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С‚РѕР»СЊРєРѕ РєРѕРіРґР° injectOnExit() == true Рё С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ РЅРµ void.
     */
    @Target(ElementType.PARAMETER)
    @interface ReturnValue {
    }
}
