package ru.hook.asm;


/**
 * Р’ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё РѕС‚ СЌС‚РѕРіРѕ Р·РЅР°С‡РµРЅРёСЏ РѕРїСЂРµРґРµР»СЏРµС‚СЃСЏ, С‡С‚Рѕ РІРµСЂРЅС‘С‚ С†РµР»РµРІРѕР№ РјРµС‚РѕРґ
 * РїСЂРё РІС‹С…РѕРґРµ return РїРѕСЃР»Рµ РІС‹Р·РѕРІР° С…СѓРє-РјРµС‚РѕРґР°.
 */
public enum ReturnValue {

    /**
     * Р’РѕР·РІСЂР°С‰Р°РµС‚СЃСЏ void.
     * Р�СЃРїРѕР»СЊР·СѓРµС‚СЃСЏ С‚РѕРіРґР° Рё С‚РѕР»СЊРєРѕ С‚РѕРіРґР°, РєРѕРіРґР° С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ void.
     */
    VOID,

    /**
     * Р’РѕР·РІСЂР°С‰Р°РµС‚СЃСЏ Р·Р°СЂР°РЅРµРµ СѓСЃС‚Р°РЅРѕРІР»РµРЅРЅРѕРµ РїСЂРёРјРёС‚РёС‡РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ.
     * РњРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С‚РѕР»СЊРєРѕ РєРѕРіРґР° С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ РїСЂРёРјРёС‚РёРІ.
     */
    PRIMITIVE_CONSTANT,

    /**
     * Р’РѕР·РІСЂР°С‰Р°РµС‚СЃСЏ null.
     * РњРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С‚РѕР»СЊРєРѕ РєРѕРіРґР° С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ РѕР±СЉРµРєС‚.
     */
    NULL,

    /**
     * Р’РѕР·РІСЂР°С‰Р°РµС‚СЃСЏ С‚РѕС‚ РїСЂРёРјРёС‚РёРІ РёР»Рё РѕР±СЉРµРєС‚, РєРѕС‚РѕСЂС‹Р№ РІРµСЂРЅСѓР» С…СѓРє-РјРµС‚РѕРґ.
     * РњРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РІРѕ РІСЃРµС… СЃР»СѓС‡Р°СЏС…, РєСЂРѕРјРµ С‚РѕРіРѕ, РєРѕРіРґР° С†РµР»РµРІРѕР№ РјРµС‚РѕРґ РІРѕР·РІСЂР°С‰Р°РµС‚ void.
     */
    HOOK_RETURN_VALUE,

    /**
     * Р’С‹Р·С‹РІР°РµС‚ РґСЂСѓРіРѕР№ РјРµС‚РѕРґ РІ С‚РѕРј Р¶Рµ РєР»Р°СЃСЃРµ Рё СЃ С‚РµРјРё Р¶Рµ РїР°СЂР°РјРµС‚СЂР°РјРё, С‡С‚Рѕ Рё С…СѓРє-РјРµС‚РѕРґ, РЅРѕ СЃ РґСЂСѓРіРёРј РЅР°Р·РІР°РЅРёРµРј.
     * Р’РѕР·РІСЂР°С‰Р°РµС‚ РїСЂРёРјРёС‚РёРІ РёР»Рё РѕР±СЉРµРєС‚, РєРѕС‚РѕСЂС‹Р№ РІРµСЂРЅСѓР» РІС‹Р·РІР°РЅРЅС‹Р№ РјРµС‚РѕРґ.
     */
    ANOTHER_METHOD_RETURN_VALUE

}
